<?php

use Tygh\Registry;
use Tygh\Tygh;
use Tygh\Enum\ProfileFieldSections;

defined('BOOTSTRAP') or die('Access denied');

if ($_SERVER['REQUEST_METHOD'] == 'POST') {

    if ($mode === 'update') {

        $field_data = $_REQUEST['field_data'];

        if (empty($field_data['field_id']) && !empty($field_data['field_name'])) {
            
            $field_data['add_values'] = [];
            
            $variants = fn_cp_checkout_modifications_get_profile_fields_variants($field_data['field_name']);
            if (!empty($variants)) {
                $field_data['add_values'] = [];
                $position = 0;
                foreach  ($variants as $variant) {
                    $field_data['add_values'][] = [
                        'position' => ++$position,
                        'description' => $variant,
                    ];
                }

                $_REQUEST['field_data'] = $field_data;
            }
        }
    }
}

function fn_cp_checkout_modifications_get_profile_fields_variants($field_name)
{   
    if ($field_name == 'edo_availability') {
        $variants =  [
            "АО ПФ СКБ Контур",
            "АНО БЕЛИНФОНАЛОГ",
            "ОАО ИнфоТеКС Интернет Траст",
            "ООО ЭЛБИС",
            "ООО Компания Тензор",
            "ООО КОРУС Консалтинг СНГ",
            "ООО Такском",
            "ООО АРГОС",
            "ООО Русь-Телеком",
            "ООО Сибтел-Крипто",
            "АО Калуга Астрал",
            "ООО РПЦ Партнер",
            "ООО НПП Ижинформпроект",
            "ОАО СКБ-банк",
            "ЗАО РЦ Практик",
            "АО ГНИВЦ",
            "УФМФ АО ЦентрИнформ",
            "ООО РСЦ Инфо-Бухгалтер",
            "ЗАО Сервер-Центр",
            "ЗАО ЦЭК",
            "ООО Электронный Экспресс",
            "АО ЦентрИнформ",
            "ООО Линк-Сервис",
            "ООО ИМЦ",
            "ЗАО ТаксНет",
            "ООО УЦ ГИС",
            "ЗАО Новокузнецктелефонстрой",
            "АО УДОСТОВЕРЯЮЩИЙ ЦЕНТР",
            "ООО Сибирские телекоммуникации",
            "ООО Гвард-Информ",
            "ООО УЦ Аском",
            "НФ АО ЦентрИнформ",
            "ООО ЭСОТЕЛ-Рустелком",
            "ООО Безопасные информационные технологии",
            "ООО Технокад",
            "ЗАО НТЦ СТЭК",
            "ООО Роста",
            "ООО Центр Бухгалтерских Услуг",
            "ООО ЦДС",
            "ООО КДС",
            "ООО КРИПТЭКС",
            "АНО ИО Деловой вестник",
            "АО Эридан",
            "ОГБУ Белгородский информационный фонд",
            "ООО Компьютерные технологии",
            "ООО Деловые Сети",
            "КрвФ АО ЦентрИнформ",
            "ООО ИЦ Выбор",
            "ООО ТЕЛ",
            "ООО МО ПНИЭИ-КрасКрипт",
            "ОАО Центр информатизации Республики Мордовия",
            "ООО УНЦИБ",
            "НвсФ АО ЦентрИнформ",
            "ООО УЦ Сибири",
            "УлнФ АО ЦентрИнформ",
            "МУП АРЦИС",
            "ООО ИНЕТ",
            "ООО Северо-Западный Таможенно-Логистический Сервис",
            "ООО ТК Контакт",
            "ЗАО Удостоверяющий центр",
            "ООО Салон 2116 - электронный почтамп",
            "Пермский филиал ПАО Ростелеком",
            "АО НУЦ",
            "ООО Аргос СПб",
            "ООО Эврика",
            "ООО Информзащита",
            "ООО УЦ СОЮЗ",
            "ООО Солар",
            "ООО Фалькон Плюс",
            "ЗАО СИБЕРИЯ",
            "ООО Небо",
            "ООО НПФ ИСБ",
            "ООО Альфа-сервис",
            "ООО Такснет-сервис",
            "ООО ЦЗИ ГРИФ",
            "ООО ВОСТКОМ",
            "ООО НТСсофт",
            "ООО УЦ Белинфоналог",
            "ООО Индекс ПК",
            "ООО ЭТП ГПБ",
            "ООО МАГТЕЛ",
            "ЗАО Информационный центр",
            "ООО Бифит ЭДО",
            "ООО Э-КОМ",
            "ООО Финтендер-Крипто",
            "ООО МАСКОМ-Техлайн",
            "ОАО НИИАС",
            "ООО ПРОФИ Менеджер",
            "ООО ЕКЕЙ УЦ",
            "АО ТЭК-Торг",
            "ООО ПС СТ",
            "ООО Сберключ",
            "ООО Эвотор ОФД",
            "ООО К-Сервис",
            "ООО Оператор-ЦРПТ",
            "ООО ИРИС",
            "ООО Факторин",
        ];
    }
    elseif ($field_name == 'activity_field') {
        
        $variants = [
            "Региональная сервисная компания",
            "Торговая компания",
            "Владелец/арендатор техники"
        ];
    }

    return !empty($variants) ? $variants : [];
}
